src/main/resources/xmls/salesforcequery/QueryRequest.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Header>
    <SessionHeader xmlns="urn:partner.soap.sforce.com">
      <sessionId></sessionId>
    </SessionHeader><CallOptions xmlns="urn:partner.soap.sforce.com"><client></client><defaultNamespace /></CallOptions>
  </Header>
  <Body>
    <query xmlns="urn:partner.soap.sforce.com">
      <queryString></queryString>
    </query>
  </Body>
</Envelope>